// 楼栋-单元-房号级联菜单数据
const buildingData = [
  {
    "value": "1",
    "label": "1栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "1-1-201",
            "label": "201号"
          },
          {
            "value": "1-1-202",
            "label": "202号"
          },
          {
            "value": "1-1-301",
            "label": "301号"
          },
          {
            "value": "1-1-302",
            "label": "302号"
          },
          {
            "value": "1-1-401",
            "label": "401号"
          },
          {
            "value": "1-1-402",
            "label": "402号"
          },
          {
            "value": "1-1-501",
            "label": "501号"
          },
          {
            "value": "1-1-502",
            "label": "502号"
          },
          {
            "value": "1-1-601",
            "label": "601号"
          },
          {
            "value": "1-1-602",
            "label": "602号"
          },
          {
            "value": "1-1-701",
            "label": "701号"
          },
          {
            "value": "1-1-702",
            "label": "702号"
          },
          {
            "value": "1-1-801",
            "label": "801号"
          },
          {
            "value": "1-1-802",
            "label": "802号"
          },
          {
            "value": "1-1-901",
            "label": "901号"
          },
          {
            "value": "1-1-902",
            "label": "902号"
          },
          {
            "value": "1-1-1001",
            "label": "1001号"
          },
          {
            "value": "1-1-1002",
            "label": "1002号"
          },
          {
            "value": "1-1-1101",
            "label": "1101号"
          },
          {
            "value": "1-1-1102",
            "label": "1102号"
          },
          {
            "value": "1-1-1201",
            "label": "1201号"
          },
          {
            "value": "1-1-1202",
            "label": "1202号"
          },
          {
            "value": "1-1-1301",
            "label": "1301号"
          },
          {
            "value": "1-1-1302",
            "label": "1302号"
          },
          {
            "value": "1-1-1401",
            "label": "1401号"
          },
          {
            "value": "1-1-1402",
            "label": "1402号"
          },
          {
            "value": "1-1-1501",
            "label": "1501号"
          },
          {
            "value": "1-1-1502",
            "label": "1502号"
          },
          {
            "value": "1-1-1601",
            "label": "1601号"
          },
          {
            "value": "1-1-1602",
            "label": "1602号"
          }
        ]
      },
      {
        "value": "2",
        "label": "2单元",
        "children": [
          {
            "value": "1-2-201",
            "label": "201号"
          },
          {
            "value": "1-2-202",
            "label": "202号"
          },
          {
            "value": "1-2-301",
            "label": "301号"
          },
          {
            "value": "1-2-302",
            "label": "302号"
          },
          {
            "value": "1-2-401",
            "label": "401号"
          },
          {
            "value": "1-2-402",
            "label": "402号"
          },
          {
            "value": "1-2-501",
            "label": "501号"
          },
          {
            "value": "1-2-502",
            "label": "502号"
          },
          {
            "value": "1-2-601",
            "label": "601号"
          },
          {
            "value": "1-2-602",
            "label": "602号"
          },
          {
            "value": "1-2-701",
            "label": "701号"
          },
          {
            "value": "1-2-702",
            "label": "702号"
          },
          {
            "value": "1-2-801",
            "label": "801号"
          },
          {
            "value": "1-2-802",
            "label": "802号"
          },
          {
            "value": "1-2-901",
            "label": "901号"
          },
          {
            "value": "1-2-902",
            "label": "902号"
          },
          {
            "value": "1-2-1001",
            "label": "1001号"
          },
          {
            "value": "1-2-1002",
            "label": "1002号"
          },
          {
            "value": "1-2-1101",
            "label": "1101号"
          },
          {
            "value": "1-2-1102",
            "label": "1102号"
          },
          {
            "value": "1-2-1201",
            "label": "1201号"
          },
          {
            "value": "1-2-1202",
            "label": "1202号"
          },
          {
            "value": "1-2-1301",
            "label": "1301号"
          },
          {
            "value": "1-2-1302",
            "label": "1302号"
          },
          {
            "value": "1-2-1401",
            "label": "1401号"
          },
          {
            "value": "1-2-1402",
            "label": "1402号"
          },
          {
            "value": "1-2-1501",
            "label": "1501号"
          },
          {
            "value": "1-2-1502",
            "label": "1502号"
          },
          {
            "value": "1-2-1601",
            "label": "1601号"
          },
          {
            "value": "1-2-1602",
            "label": "1602号"
          }
        ]
      }
    ]
  },
  {
    "value": "2",
    "label": "2栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "2-1-101",
            "label": "101号"
          },
          {
            "value": "2-1-102",
            "label": "102号"
          },
          {
            "value": "2-1-201",
            "label": "201号"
          },
          {
            "value": "2-1-202",
            "label": "202号"
          },
          {
            "value": "2-1-301",
            "label": "301号"
          },
          {
            "value": "2-1-302",
            "label": "302号"
          },
          {
            "value": "2-1-401",
            "label": "401号"
          },
          {
            "value": "2-1-402",
            "label": "402号"
          },
          {
            "value": "2-1-501",
            "label": "501号"
          },
          {
            "value": "2-1-502",
            "label": "502号"
          },
          {
            "value": "2-1-601",
            "label": "601号"
          },
          {
            "value": "2-1-602",
            "label": "602号"
          },
          {
            "value": "2-1-701",
            "label": "701号"
          },
          {
            "value": "2-1-702",
            "label": "702号"
          },
          {
            "value": "2-1-801",
            "label": "801号"
          },
          {
            "value": "2-1-802",
            "label": "802号"
          },
          {
            "value": "2-1-901",
            "label": "901号"
          },
          {
            "value": "2-1-902",
            "label": "902号"
          },
          {
            "value": "2-1-1001",
            "label": "1001号"
          },
          {
            "value": "2-1-1002",
            "label": "1002号"
          },
          {
            "value": "2-1-1101",
            "label": "1101号"
          },
          {
            "value": "2-1-1102",
            "label": "1102号"
          },
          {
            "value": "2-1-1201",
            "label": "1201号"
          },
          {
            "value": "2-1-1202",
            "label": "1202号"
          },
          {
            "value": "2-1-1301",
            "label": "1301号"
          },
          {
            "value": "2-1-1302",
            "label": "1302号"
          }
        ]
      }
    ]
  },
  {
    "value": "3",
    "label": "3栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "3-1-101",
            "label": "101号"
          },
          {
            "value": "3-1-102",
            "label": "102号"
          },
          {
            "value": "3-1-201",
            "label": "201号"
          },
          {
            "value": "3-1-202",
            "label": "202号"
          },
          {
            "value": "3-1-301",
            "label": "301号"
          },
          {
            "value": "3-1-302",
            "label": "302号"
          },
          {
            "value": "3-1-401",
            "label": "401号"
          },
          {
            "value": "3-1-402",
            "label": "402号"
          },
          {
            "value": "3-1-501",
            "label": "501号"
          },
          {
            "value": "3-1-502",
            "label": "502号"
          },
          {
            "value": "3-1-601",
            "label": "601号"
          },
          {
            "value": "3-1-602",
            "label": "602号"
          },
          {
            "value": "3-1-701",
            "label": "701号"
          },
          {
            "value": "3-1-702",
            "label": "702号"
          },
          {
            "value": "3-1-801",
            "label": "801号"
          },
          {
            "value": "3-1-802",
            "label": "802号"
          },
          {
            "value": "3-1-901",
            "label": "901号"
          },
          {
            "value": "3-1-902",
            "label": "902号"
          },
          {
            "value": "3-1-1001",
            "label": "1001号"
          },
          {
            "value": "3-1-1002",
            "label": "1002号"
          },
          {
            "value": "3-1-1101",
            "label": "1101号"
          },
          {
            "value": "3-1-1102",
            "label": "1102号"
          },
          {
            "value": "3-1-1201",
            "label": "1201号"
          },
          {
            "value": "3-1-1202",
            "label": "1202号"
          },
          {
            "value": "3-1-1301",
            "label": "1301号"
          },
          {
            "value": "3-1-1302",
            "label": "1302号"
          }
        ]
      }
    ]
  },
  {
    "value": "4",
    "label": "4栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "4-1-101",
            "label": "101号"
          },
          {
            "value": "4-1-102",
            "label": "102号"
          },
          {
            "value": "4-1-201",
            "label": "201号"
          },
          {
            "value": "4-1-202",
            "label": "202号"
          },
          {
            "value": "4-1-301",
            "label": "301号"
          },
          {
            "value": "4-1-302",
            "label": "302号"
          },
          {
            "value": "4-1-401",
            "label": "401号"
          },
          {
            "value": "4-1-402",
            "label": "402号"
          },
          {
            "value": "4-1-501",
            "label": "501号"
          },
          {
            "value": "4-1-502",
            "label": "502号"
          },
          {
            "value": "4-1-601",
            "label": "601号"
          },
          {
            "value": "4-1-602",
            "label": "602号"
          },
          {
            "value": "4-1-701",
            "label": "701号"
          },
          {
            "value": "4-1-702",
            "label": "702号"
          },
          {
            "value": "4-1-801",
            "label": "801号"
          },
          {
            "value": "4-1-802",
            "label": "802号"
          },
          {
            "value": "4-1-901",
            "label": "901号"
          },
          {
            "value": "4-1-902",
            "label": "902号"
          },
          {
            "value": "4-1-1001",
            "label": "1001号"
          },
          {
            "value": "4-1-1002",
            "label": "1002号"
          },
          {
            "value": "4-1-1101",
            "label": "1101号"
          },
          {
            "value": "4-1-1102",
            "label": "1102号"
          },
          {
            "value": "4-1-1201",
            "label": "1201号"
          },
          {
            "value": "4-1-1202",
            "label": "1202号"
          },
          {
            "value": "4-1-1301",
            "label": "1301号"
          },
          {
            "value": "4-1-1302",
            "label": "1302号"
          }
        ]
      }
    ]
  },
  {
    "value": "5",
    "label": "5栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "5-1-101",
            "label": "101号"
          },
          {
            "value": "5-1-102",
            "label": "102号"
          },
          {
            "value": "5-1-201",
            "label": "201号"
          },
          {
            "value": "5-1-202",
            "label": "202号"
          },
          {
            "value": "5-1-301",
            "label": "301号"
          },
          {
            "value": "5-1-302",
            "label": "302号"
          },
          {
            "value": "5-1-401",
            "label": "401号"
          },
          {
            "value": "5-1-402",
            "label": "402号"
          },
          {
            "value": "5-1-501",
            "label": "501号"
          },
          {
            "value": "5-1-502",
            "label": "502号"
          },
          {
            "value": "5-1-601",
            "label": "601号"
          },
          {
            "value": "5-1-602",
            "label": "602号"
          },
          {
            "value": "5-1-701",
            "label": "701号"
          },
          {
            "value": "5-1-702",
            "label": "702号"
          },
          {
            "value": "5-1-801",
            "label": "801号"
          },
          {
            "value": "5-1-802",
            "label": "802号"
          },
          {
            "value": "5-1-901",
            "label": "901号"
          },
          {
            "value": "5-1-902",
            "label": "902号"
          },
          {
            "value": "5-1-1001",
            "label": "1001号"
          },
          {
            "value": "5-1-1002",
            "label": "1002号"
          },
          {
            "value": "5-1-1101",
            "label": "1101号"
          },
          {
            "value": "5-1-1102",
            "label": "1102号"
          },
          {
            "value": "5-1-1201",
            "label": "1201号"
          },
          {
            "value": "5-1-1202",
            "label": "1202号"
          },
          {
            "value": "5-1-1301",
            "label": "1301号"
          },
          {
            "value": "5-1-1302",
            "label": "1302号"
          },
          {
            "value": "5-1-1401",
            "label": "1401号"
          },
          {
            "value": "5-1-1402",
            "label": "1402号"
          },
          {
            "value": "5-1-1501",
            "label": "1501号"
          },
          {
            "value": "5-1-1502",
            "label": "1502号"
          },
          {
            "value": "5-1-1601",
            "label": "1601号"
          },
          {
            "value": "5-1-1602",
            "label": "1602号"
          }
        ]
      },
      {
        "value": "2",
        "label": "2单元",
        "children": [
          {
            "value": "5-2-101",
            "label": "101号"
          },
          {
            "value": "5-2-102",
            "label": "102号"
          },
          {
            "value": "5-2-201",
            "label": "201号"
          },
          {
            "value": "5-2-202",
            "label": "202号"
          },
          {
            "value": "5-2-301",
            "label": "301号"
          },
          {
            "value": "5-2-302",
            "label": "302号"
          },
          {
            "value": "5-2-401",
            "label": "401号"
          },
          {
            "value": "5-2-402",
            "label": "402号"
          },
          {
            "value": "5-2-501",
            "label": "501号"
          },
          {
            "value": "5-2-502",
            "label": "502号"
          },
          {
            "value": "5-2-601",
            "label": "601号"
          },
          {
            "value": "5-2-602",
            "label": "602号"
          },
          {
            "value": "5-2-701",
            "label": "701号"
          },
          {
            "value": "5-2-702",
            "label": "702号"
          },
          {
            "value": "5-2-801",
            "label": "801号"
          },
          {
            "value": "5-2-802",
            "label": "802号"
          },
          {
            "value": "5-2-901",
            "label": "901号"
          },
          {
            "value": "5-2-902",
            "label": "902号"
          },
          {
            "value": "5-2-1001",
            "label": "1001号"
          },
          {
            "value": "5-2-1002",
            "label": "1002号"
          },
          {
            "value": "5-2-1101",
            "label": "1101号"
          },
          {
            "value": "5-2-1102",
            "label": "1102号"
          },
          {
            "value": "5-2-1201",
            "label": "1201号"
          },
          {
            "value": "5-2-1202",
            "label": "1202号"
          },
          {
            "value": "5-2-1301",
            "label": "1301号"
          },
          {
            "value": "5-2-1302",
            "label": "1302号"
          },
          {
            "value": "5-2-1401",
            "label": "1401号"
          },
          {
            "value": "5-2-1402",
            "label": "1402号"
          },
          {
            "value": "5-2-1501",
            "label": "1501号"
          },
          {
            "value": "5-2-1502",
            "label": "1502号"
          },
          {
            "value": "5-2-1601",
            "label": "1601号"
          },
          {
            "value": "5-2-1602",
            "label": "1602号"
          }
        ]
      }
    ]
  },
  {
    "value": "6",
    "label": "6栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "6-1-101",
            "label": "101号"
          },
          {
            "value": "6-1-102",
            "label": "102号"
          },
          {
            "value": "6-1-201",
            "label": "201号"
          },
          {
            "value": "6-1-202",
            "label": "202号"
          },
          {
            "value": "6-1-301",
            "label": "301号"
          },
          {
            "value": "6-1-302",
            "label": "302号"
          },
          {
            "value": "6-1-401",
            "label": "401号"
          },
          {
            "value": "6-1-402",
            "label": "402号"
          },
          {
            "value": "6-1-501",
            "label": "501号"
          },
          {
            "value": "6-1-502",
            "label": "502号"
          },
          {
            "value": "6-1-601",
            "label": "601号"
          },
          {
            "value": "6-1-602",
            "label": "602号"
          },
          {
            "value": "6-1-701",
            "label": "701号"
          },
          {
            "value": "6-1-702",
            "label": "702号"
          },
          {
            "value": "6-1-801",
            "label": "801号"
          },
          {
            "value": "6-1-802",
            "label": "802号"
          },
          {
            "value": "6-1-901",
            "label": "901号"
          },
          {
            "value": "6-1-902",
            "label": "902号"
          },
          {
            "value": "6-1-1001",
            "label": "1001号"
          },
          {
            "value": "6-1-1002",
            "label": "1002号"
          },
          {
            "value": "6-1-1101",
            "label": "1101号"
          },
          {
            "value": "6-1-1102",
            "label": "1102号"
          },
          {
            "value": "6-1-1201",
            "label": "1201号"
          },
          {
            "value": "6-1-1202",
            "label": "1202号"
          },
          {
            "value": "6-1-1301",
            "label": "1301号"
          },
          {
            "value": "6-1-1302",
            "label": "1302号"
          },
          {
            "value": "6-1-1401",
            "label": "1401号"
          },
          {
            "value": "6-1-1402",
            "label": "1402号"
          },
          {
            "value": "6-1-1501",
            "label": "1501号"
          },
          {
            "value": "6-1-1502",
            "label": "1502号"
          },
          {
            "value": "6-1-1601",
            "label": "1601号"
          },
          {
            "value": "6-1-1602",
            "label": "1602号"
          },
          {
            "value": "6-1-1701",
            "label": "1701号"
          },
          {
            "value": "6-1-1702",
            "label": "1702号"
          }
        ]
      }
    ]
  },
  {
    "value": "7",
    "label": "7栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "7-1-101",
            "label": "101号"
          },
          {
            "value": "7-1-102",
            "label": "102号"
          },
          {
            "value": "7-1-201",
            "label": "201号"
          },
          {
            "value": "7-1-202",
            "label": "202号"
          },
          {
            "value": "7-1-301",
            "label": "301号"
          },
          {
            "value": "7-1-302",
            "label": "302号"
          },
          {
            "value": "7-1-303",
            "label": "303号"
          },
          {
            "value": "7-1-304",
            "label": "304号"
          },
          {
            "value": "7-1-401",
            "label": "401号"
          },
          {
            "value": "7-1-402",
            "label": "402号"
          },
          {
            "value": "7-1-403",
            "label": "403号"
          },
          {
            "value": "7-1-404",
            "label": "404号"
          },
          {
            "value": "7-1-501",
            "label": "501号"
          },
          {
            "value": "7-1-502",
            "label": "502号"
          },
          {
            "value": "7-1-503",
            "label": "503号"
          },
          {
            "value": "7-1-504",
            "label": "504号"
          },
          {
            "value": "7-1-601",
            "label": "601号"
          },
          {
            "value": "7-1-602",
            "label": "602号"
          },
          {
            "value": "7-1-603",
            "label": "603号"
          },
          {
            "value": "7-1-604",
            "label": "604号"
          },
          {
            "value": "7-1-701",
            "label": "701号"
          },
          {
            "value": "7-1-702",
            "label": "702号"
          },
          {
            "value": "7-1-703",
            "label": "703号"
          },
          {
            "value": "7-1-704",
            "label": "704号"
          },
          {
            "value": "7-1-801",
            "label": "801号"
          },
          {
            "value": "7-1-802",
            "label": "802号"
          },
          {
            "value": "7-1-803",
            "label": "803号"
          },
          {
            "value": "7-1-804",
            "label": "804号"
          },
          {
            "value": "7-1-901",
            "label": "901号"
          },
          {
            "value": "7-1-902",
            "label": "902号"
          },
          {
            "value": "7-1-903",
            "label": "903号"
          },
          {
            "value": "7-1-904",
            "label": "904号"
          },
          {
            "value": "7-1-1001",
            "label": "1001号"
          },
          {
            "value": "7-1-1002",
            "label": "1002号"
          },
          {
            "value": "7-1-1003",
            "label": "1003号"
          },
          {
            "value": "7-1-1004",
            "label": "1004号"
          },
          {
            "value": "7-1-1101",
            "label": "1101号"
          },
          {
            "value": "7-1-1102",
            "label": "1102号"
          },
          {
            "value": "7-1-1103",
            "label": "1103号"
          },
          {
            "value": "7-1-1104",
            "label": "1104号"
          },
          {
            "value": "7-1-1201",
            "label": "1201号"
          },
          {
            "value": "7-1-1202",
            "label": "1202号"
          },
          {
            "value": "7-1-1203",
            "label": "1203号"
          },
          {
            "value": "7-1-1204",
            "label": "1204号"
          },
          {
            "value": "7-1-1301",
            "label": "1301号"
          },
          {
            "value": "7-1-1302",
            "label": "1302号"
          },
          {
            "value": "7-1-1303",
            "label": "1303号"
          },
          {
            "value": "7-1-1304",
            "label": "1304号"
          },
          {
            "value": "7-1-1401",
            "label": "1401号"
          },
          {
            "value": "7-1-1402",
            "label": "1402号"
          },
          {
            "value": "7-1-1403",
            "label": "1403号"
          },
          {
            "value": "7-1-1404",
            "label": "1404号"
          },
          {
            "value": "7-1-1501",
            "label": "1501号"
          },
          {
            "value": "7-1-1502",
            "label": "1502号"
          },
          {
            "value": "7-1-1503",
            "label": "1503号"
          },
          {
            "value": "7-1-1504",
            "label": "1504号"
          },
          {
            "value": "7-1-1601",
            "label": "1601号"
          },
          {
            "value": "7-1-1602",
            "label": "1602号"
          },
          {
            "value": "7-1-1603",
            "label": "1603号"
          },
          {
            "value": "7-1-1604",
            "label": "1604号"
          },
          {
            "value": "7-1-1701",
            "label": "1701号"
          },
          {
            "value": "7-1-1702",
            "label": "1702号"
          },
          {
            "value": "7-1-1703",
            "label": "1703号"
          },
          {
            "value": "7-1-1704",
            "label": "1704号"
          },
          {
            "value": "7-1-1801",
            "label": "1801号"
          },
          {
            "value": "7-1-1802",
            "label": "1802号"
          },
          {
            "value": "7-1-1803",
            "label": "1803号"
          },
          {
            "value": "7-1-1804",
            "label": "1804号"
          },
          {
            "value": "7-1-1901",
            "label": "1901号"
          },
          {
            "value": "7-1-1902",
            "label": "1902号"
          },
          {
            "value": "7-1-1903",
            "label": "1903号"
          },
          {
            "value": "7-1-1904",
            "label": "1904号"
          },
          {
            "value": "7-1-2001",
            "label": "2001号"
          },
          {
            "value": "7-1-2002",
            "label": "2002号"
          },
          {
            "value": "7-1-2003",
            "label": "2003号"
          },
          {
            "value": "7-1-2004",
            "label": "2004号"
          },
          {
            "value": "7-1-2101",
            "label": "2101号"
          },
          {
            "value": "7-1-2102",
            "label": "2102号"
          },
          {
            "value": "7-1-2103",
            "label": "2103号"
          },
          {
            "value": "7-1-2104",
            "label": "2104号"
          },
          {
            "value": "7-1-2201",
            "label": "2201号"
          },
          {
            "value": "7-1-2202",
            "label": "2202号"
          },
          {
            "value": "7-1-2203",
            "label": "2203号"
          },
          {
            "value": "7-1-2204",
            "label": "2204号"
          },
          {
            "value": "7-1-2301",
            "label": "2301号"
          },
          {
            "value": "7-1-2302",
            "label": "2302号"
          },
          {
            "value": "7-1-2303",
            "label": "2303号"
          },
          {
            "value": "7-1-2304",
            "label": "2304号"
          },
          {
            "value": "7-1-2401",
            "label": "2401号"
          },
          {
            "value": "7-1-2402",
            "label": "2402号"
          },
          {
            "value": "7-1-2403",
            "label": "2403号"
          },
          {
            "value": "7-1-2404",
            "label": "2404号"
          },
          {
            "value": "7-1-2501",
            "label": "2501号"
          },
          {
            "value": "7-1-2502",
            "label": "2502号"
          },
          {
            "value": "7-1-2503",
            "label": "2503号"
          },
          {
            "value": "7-1-2504",
            "label": "2504号"
          },
          {
            "value": "7-1-2601",
            "label": "2601号"
          },
          {
            "value": "7-1-2602",
            "label": "2602号"
          },
          {
            "value": "7-1-2603",
            "label": "2603号"
          },
          {
            "value": "7-1-2604",
            "label": "2604号"
          },
          {
            "value": "7-1-2701",
            "label": "2701号"
          },
          {
            "value": "7-1-2702",
            "label": "2702号"
          },
          {
            "value": "7-1-2703",
            "label": "2703号"
          },
          {
            "value": "7-1-2704",
            "label": "2704号"
          },
          {
            "value": "7-1-2801",
            "label": "2801号"
          },
          {
            "value": "7-1-2802",
            "label": "2802号"
          },
          {
            "value": "7-1-2803",
            "label": "2803号"
          },
          {
            "value": "7-1-2804",
            "label": "2804号"
          },
          {
            "value": "7-1-2901",
            "label": "2901号"
          },
          {
            "value": "7-1-2902",
            "label": "2902号"
          },
          {
            "value": "7-1-2903",
            "label": "2903号"
          },
          {
            "value": "7-1-2904",
            "label": "2904号"
          },
          {
            "value": "7-1-3001",
            "label": "3001号"
          },
          {
            "value": "7-1-3002",
            "label": "3002号"
          },
          {
            "value": "7-1-3003",
            "label": "3003号"
          },
          {
            "value": "7-1-3004",
            "label": "3004号"
          },
          {
            "value": "7-1-3101",
            "label": "3101号"
          },
          {
            "value": "7-1-3102",
            "label": "3102号"
          },
          {
            "value": "7-1-3103",
            "label": "3103号"
          },
          {
            "value": "7-1-3104",
            "label": "3104号"
          }
        ]
      }
    ]
  },
  {
    "value": "8",
    "label": "8栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "8-1-101",
            "label": "101号"
          },
          {
            "value": "8-1-102",
            "label": "102号"
          },
          {
            "value": "8-1-201",
            "label": "201号"
          },
          {
            "value": "8-1-202",
            "label": "202号"
          },
          {
            "value": "8-1-301",
            "label": "301号"
          },
          {
            "value": "8-1-302",
            "label": "302号"
          },
          {
            "value": "8-1-303",
            "label": "303号"
          },
          {
            "value": "8-1-304",
            "label": "304号"
          },
          {
            "value": "8-1-401",
            "label": "401号"
          },
          {
            "value": "8-1-402",
            "label": "402号"
          },
          {
            "value": "8-1-403",
            "label": "403号"
          },
          {
            "value": "8-1-404",
            "label": "404号"
          },
          {
            "value": "8-1-501",
            "label": "501号"
          },
          {
            "value": "8-1-502",
            "label": "502号"
          },
          {
            "value": "8-1-503",
            "label": "503号"
          },
          {
            "value": "8-1-504",
            "label": "504号"
          },
          {
            "value": "8-1-601",
            "label": "601号"
          },
          {
            "value": "8-1-602",
            "label": "602号"
          },
          {
            "value": "8-1-603",
            "label": "603号"
          },
          {
            "value": "8-1-604",
            "label": "604号"
          },
          {
            "value": "8-1-701",
            "label": "701号"
          },
          {
            "value": "8-1-702",
            "label": "702号"
          },
          {
            "value": "8-1-703",
            "label": "703号"
          },
          {
            "value": "8-1-704",
            "label": "704号"
          },
          {
            "value": "8-1-801",
            "label": "801号"
          },
          {
            "value": "8-1-802",
            "label": "802号"
          },
          {
            "value": "8-1-803",
            "label": "803号"
          },
          {
            "value": "8-1-804",
            "label": "804号"
          },
          {
            "value": "8-1-901",
            "label": "901号"
          },
          {
            "value": "8-1-902",
            "label": "902号"
          },
          {
            "value": "8-1-903",
            "label": "903号"
          },
          {
            "value": "8-1-904",
            "label": "904号"
          },
          {
            "value": "8-1-1001",
            "label": "1001号"
          },
          {
            "value": "8-1-1002",
            "label": "1002号"
          },
          {
            "value": "8-1-1003",
            "label": "1003号"
          },
          {
            "value": "8-1-1004",
            "label": "1004号"
          },
          {
            "value": "8-1-1101",
            "label": "1101号"
          },
          {
            "value": "8-1-1102",
            "label": "1102号"
          },
          {
            "value": "8-1-1103",
            "label": "1103号"
          },
          {
            "value": "8-1-1104",
            "label": "1104号"
          },
          {
            "value": "8-1-1201",
            "label": "1201号"
          },
          {
            "value": "8-1-1202",
            "label": "1202号"
          },
          {
            "value": "8-1-1203",
            "label": "1203号"
          },
          {
            "value": "8-1-1204",
            "label": "1204号"
          },
          {
            "value": "8-1-1301",
            "label": "1301号"
          },
          {
            "value": "8-1-1302",
            "label": "1302号"
          },
          {
            "value": "8-1-1303",
            "label": "1303号"
          },
          {
            "value": "8-1-1304",
            "label": "1304号"
          },
          {
            "value": "8-1-1401",
            "label": "1401号"
          },
          {
            "value": "8-1-1402",
            "label": "1402号"
          },
          {
            "value": "8-1-1403",
            "label": "1403号"
          },
          {
            "value": "8-1-1404",
            "label": "1404号"
          },
          {
            "value": "8-1-1501",
            "label": "1501号"
          },
          {
            "value": "8-1-1502",
            "label": "1502号"
          },
          {
            "value": "8-1-1503",
            "label": "1503号"
          },
          {
            "value": "8-1-1504",
            "label": "1504号"
          },
          {
            "value": "8-1-1601",
            "label": "1601号"
          },
          {
            "value": "8-1-1602",
            "label": "1602号"
          },
          {
            "value": "8-1-1603",
            "label": "1603号"
          },
          {
            "value": "8-1-1604",
            "label": "1604号"
          },
          {
            "value": "8-1-1701",
            "label": "1701号"
          },
          {
            "value": "8-1-1702",
            "label": "1702号"
          },
          {
            "value": "8-1-1703",
            "label": "1703号"
          },
          {
            "value": "8-1-1704",
            "label": "1704号"
          },
          {
            "value": "8-1-1801",
            "label": "1801号"
          },
          {
            "value": "8-1-1802",
            "label": "1802号"
          },
          {
            "value": "8-1-1803",
            "label": "1803号"
          },
          {
            "value": "8-1-1804",
            "label": "1804号"
          },
          {
            "value": "8-1-1901",
            "label": "1901号"
          },
          {
            "value": "8-1-1902",
            "label": "1902号"
          },
          {
            "value": "8-1-1903",
            "label": "1903号"
          },
          {
            "value": "8-1-1904",
            "label": "1904号"
          },
          {
            "value": "8-1-2001",
            "label": "2001号"
          },
          {
            "value": "8-1-2002",
            "label": "2002号"
          },
          {
            "value": "8-1-2003",
            "label": "2003号"
          },
          {
            "value": "8-1-2004",
            "label": "2004号"
          },
          {
            "value": "8-1-2101",
            "label": "2101号"
          },
          {
            "value": "8-1-2102",
            "label": "2102号"
          },
          {
            "value": "8-1-2103",
            "label": "2103号"
          },
          {
            "value": "8-1-2104",
            "label": "2104号"
          },
          {
            "value": "8-1-2201",
            "label": "2201号"
          },
          {
            "value": "8-1-2202",
            "label": "2202号"
          },
          {
            "value": "8-1-2203",
            "label": "2203号"
          },
          {
            "value": "8-1-2204",
            "label": "2204号"
          },
          {
            "value": "8-1-2301",
            "label": "2301号"
          },
          {
            "value": "8-1-2302",
            "label": "2302号"
          },
          {
            "value": "8-1-2303",
            "label": "2303号"
          },
          {
            "value": "8-1-2304",
            "label": "2304号"
          },
          {
            "value": "8-1-2401",
            "label": "2401号"
          },
          {
            "value": "8-1-2402",
            "label": "2402号"
          },
          {
            "value": "8-1-2403",
            "label": "2403号"
          },
          {
            "value": "8-1-2404",
            "label": "2404号"
          },
          {
            "value": "8-1-2501",
            "label": "2501号"
          },
          {
            "value": "8-1-2502",
            "label": "2502号"
          },
          {
            "value": "8-1-2503",
            "label": "2503号"
          },
          {
            "value": "8-1-2504",
            "label": "2504号"
          },
          {
            "value": "8-1-2601",
            "label": "2601号"
          },
          {
            "value": "8-1-2602",
            "label": "2602号"
          },
          {
            "value": "8-1-2603",
            "label": "2603号"
          },
          {
            "value": "8-1-2604",
            "label": "2604号"
          },
          {
            "value": "8-1-2701",
            "label": "2701号"
          },
          {
            "value": "8-1-2702",
            "label": "2702号"
          },
          {
            "value": "8-1-2703",
            "label": "2703号"
          },
          {
            "value": "8-1-2704",
            "label": "2704号"
          },
          {
            "value": "8-1-2801",
            "label": "2801号"
          },
          {
            "value": "8-1-2802",
            "label": "2802号"
          },
          {
            "value": "8-1-2803",
            "label": "2803号"
          },
          {
            "value": "8-1-2804",
            "label": "2804号"
          },
          {
            "value": "8-1-2901",
            "label": "2901号"
          },
          {
            "value": "8-1-2902",
            "label": "2902号"
          },
          {
            "value": "8-1-2903",
            "label": "2903号"
          },
          {
            "value": "8-1-2904",
            "label": "2904号"
          },
          {
            "value": "8-1-3001",
            "label": "3001号"
          },
          {
            "value": "8-1-3002",
            "label": "3002号"
          },
          {
            "value": "8-1-3003",
            "label": "3003号"
          },
          {
            "value": "8-1-3004",
            "label": "3004号"
          },
          {
            "value": "8-1-3101",
            "label": "3101号"
          },
          {
            "value": "8-1-3102",
            "label": "3102号"
          },
          {
            "value": "8-1-3103",
            "label": "3103号"
          },
          {
            "value": "8-1-3104",
            "label": "3104号"
          },
          {
            "value": "8-1-3201",
            "label": "3201号"
          },
          {
            "value": "8-1-3202",
            "label": "3202号"
          },
          {
            "value": "8-1-3203",
            "label": "3203号"
          },
          {
            "value": "8-1-3204",
            "label": "3204号"
          },
          {
            "value": "8-1-3301",
            "label": "3301号"
          },
          {
            "value": "8-1-3302",
            "label": "3302号"
          },
          {
            "value": "8-1-3303",
            "label": "3303号"
          },
          {
            "value": "8-1-3304",
            "label": "3304号"
          }
        ]
      }
    ]
  },
  {
    "value": "9",
    "label": "9栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "9-1-101",
            "label": "101号"
          },
          {
            "value": "9-1-102",
            "label": "102号"
          },
          {
            "value": "9-1-201",
            "label": "201号"
          },
          {
            "value": "9-1-202",
            "label": "202号"
          },
          {
            "value": "9-1-301",
            "label": "301号"
          },
          {
            "value": "9-1-302",
            "label": "302号"
          },
          {
            "value": "9-1-303",
            "label": "303号"
          },
          {
            "value": "9-1-304",
            "label": "304号"
          },
          {
            "value": "9-1-401",
            "label": "401号"
          },
          {
            "value": "9-1-402",
            "label": "402号"
          },
          {
            "value": "9-1-403",
            "label": "403号"
          },
          {
            "value": "9-1-404",
            "label": "404号"
          },
          {
            "value": "9-1-501",
            "label": "501号"
          },
          {
            "value": "9-1-502",
            "label": "502号"
          },
          {
            "value": "9-1-503",
            "label": "503号"
          },
          {
            "value": "9-1-504",
            "label": "504号"
          },
          {
            "value": "9-1-601",
            "label": "601号"
          },
          {
            "value": "9-1-602",
            "label": "602号"
          },
          {
            "value": "9-1-603",
            "label": "603号"
          },
          {
            "value": "9-1-604",
            "label": "604号"
          },
          {
            "value": "9-1-701",
            "label": "701号"
          },
          {
            "value": "9-1-702",
            "label": "702号"
          },
          {
            "value": "9-1-703",
            "label": "703号"
          },
          {
            "value": "9-1-704",
            "label": "704号"
          },
          {
            "value": "9-1-801",
            "label": "801号"
          },
          {
            "value": "9-1-802",
            "label": "802号"
          },
          {
            "value": "9-1-803",
            "label": "803号"
          },
          {
            "value": "9-1-804",
            "label": "804号"
          },
          {
            "value": "9-1-901",
            "label": "901号"
          },
          {
            "value": "9-1-902",
            "label": "902号"
          },
          {
            "value": "9-1-903",
            "label": "903号"
          },
          {
            "value": "9-1-904",
            "label": "904号"
          },
          {
            "value": "9-1-1001",
            "label": "1001号"
          },
          {
            "value": "9-1-1002",
            "label": "1002号"
          },
          {
            "value": "9-1-1003",
            "label": "1003号"
          },
          {
            "value": "9-1-1004",
            "label": "1004号"
          },
          {
            "value": "9-1-1101",
            "label": "1101号"
          },
          {
            "value": "9-1-1102",
            "label": "1102号"
          },
          {
            "value": "9-1-1103",
            "label": "1103号"
          },
          {
            "value": "9-1-1104",
            "label": "1104号"
          },
          {
            "value": "9-1-1201",
            "label": "1201号"
          },
          {
            "value": "9-1-1202",
            "label": "1202号"
          },
          {
            "value": "9-1-1203",
            "label": "1203号"
          },
          {
            "value": "9-1-1204",
            "label": "1204号"
          },
          {
            "value": "9-1-1301",
            "label": "1301号"
          },
          {
            "value": "9-1-1302",
            "label": "1302号"
          },
          {
            "value": "9-1-1303",
            "label": "1303号"
          },
          {
            "value": "9-1-1304",
            "label": "1304号"
          },
          {
            "value": "9-1-1401",
            "label": "1401号"
          },
          {
            "value": "9-1-1402",
            "label": "1402号"
          },
          {
            "value": "9-1-1403",
            "label": "1403号"
          },
          {
            "value": "9-1-1404",
            "label": "1404号"
          },
          {
            "value": "9-1-1501",
            "label": "1501号"
          },
          {
            "value": "9-1-1502",
            "label": "1502号"
          },
          {
            "value": "9-1-1503",
            "label": "1503号"
          },
          {
            "value": "9-1-1504",
            "label": "1504号"
          },
          {
            "value": "9-1-1601",
            "label": "1601号"
          },
          {
            "value": "9-1-1602",
            "label": "1602号"
          },
          {
            "value": "9-1-1603",
            "label": "1603号"
          },
          {
            "value": "9-1-1604",
            "label": "1604号"
          },
          {
            "value": "9-1-1701",
            "label": "1701号"
          },
          {
            "value": "9-1-1702",
            "label": "1702号"
          },
          {
            "value": "9-1-1703",
            "label": "1703号"
          },
          {
            "value": "9-1-1704",
            "label": "1704号"
          },
          {
            "value": "9-1-1801",
            "label": "1801号"
          },
          {
            "value": "9-1-1802",
            "label": "1802号"
          },
          {
            "value": "9-1-1803",
            "label": "1803号"
          },
          {
            "value": "9-1-1804",
            "label": "1804号"
          },
          {
            "value": "9-1-1901",
            "label": "1901号"
          },
          {
            "value": "9-1-1902",
            "label": "1902号"
          },
          {
            "value": "9-1-1903",
            "label": "1903号"
          },
          {
            "value": "9-1-1904",
            "label": "1904号"
          },
          {
            "value": "9-1-2001",
            "label": "2001号"
          },
          {
            "value": "9-1-2002",
            "label": "2002号"
          },
          {
            "value": "9-1-2003",
            "label": "2003号"
          },
          {
            "value": "9-1-2004",
            "label": "2004号"
          },
          {
            "value": "9-1-2101",
            "label": "2101号"
          },
          {
            "value": "9-1-2102",
            "label": "2102号"
          },
          {
            "value": "9-1-2103",
            "label": "2103号"
          },
          {
            "value": "9-1-2104",
            "label": "2104号"
          },
          {
            "value": "9-1-2201",
            "label": "2201号"
          },
          {
            "value": "9-1-2202",
            "label": "2202号"
          },
          {
            "value": "9-1-2203",
            "label": "2203号"
          },
          {
            "value": "9-1-2204",
            "label": "2204号"
          },
          {
            "value": "9-1-2301",
            "label": "2301号"
          },
          {
            "value": "9-1-2302",
            "label": "2302号"
          },
          {
            "value": "9-1-2303",
            "label": "2303号"
          },
          {
            "value": "9-1-2304",
            "label": "2304号"
          },
          {
            "value": "9-1-2401",
            "label": "2401号"
          },
          {
            "value": "9-1-2402",
            "label": "2402号"
          },
          {
            "value": "9-1-2403",
            "label": "2403号"
          },
          {
            "value": "9-1-2404",
            "label": "2404号"
          },
          {
            "value": "9-1-2501",
            "label": "2501号"
          },
          {
            "value": "9-1-2502",
            "label": "2502号"
          },
          {
            "value": "9-1-2503",
            "label": "2503号"
          },
          {
            "value": "9-1-2504",
            "label": "2504号"
          },
          {
            "value": "9-1-2601",
            "label": "2601号"
          },
          {
            "value": "9-1-2602",
            "label": "2602号"
          },
          {
            "value": "9-1-2603",
            "label": "2603号"
          },
          {
            "value": "9-1-2604",
            "label": "2604号"
          },
          {
            "value": "9-1-2701",
            "label": "2701号"
          },
          {
            "value": "9-1-2702",
            "label": "2702号"
          },
          {
            "value": "9-1-2703",
            "label": "2703号"
          },
          {
            "value": "9-1-2704",
            "label": "2704号"
          },
          {
            "value": "9-1-2801",
            "label": "2801号"
          },
          {
            "value": "9-1-2802",
            "label": "2802号"
          },
          {
            "value": "9-1-2803",
            "label": "2803号"
          },
          {
            "value": "9-1-2804",
            "label": "2804号"
          },
          {
            "value": "9-1-2901",
            "label": "2901号"
          },
          {
            "value": "9-1-2902",
            "label": "2902号"
          },
          {
            "value": "9-1-2903",
            "label": "2903号"
          },
          {
            "value": "9-1-2904",
            "label": "2904号"
          },
          {
            "value": "9-1-3001",
            "label": "3001号"
          },
          {
            "value": "9-1-3002",
            "label": "3002号"
          },
          {
            "value": "9-1-3003",
            "label": "3003号"
          },
          {
            "value": "9-1-3004",
            "label": "3004号"
          },
          {
            "value": "9-1-3101",
            "label": "3101号"
          },
          {
            "value": "9-1-3102",
            "label": "3102号"
          },
          {
            "value": "9-1-3103",
            "label": "3103号"
          },
          {
            "value": "9-1-3104",
            "label": "3104号"
          }
        ]
      }
    ]
  },
  {
    "value": "10",
    "label": "10栋",
    "children": [
      {
        "value": "1",
        "label": "1单元",
        "children": [
          {
            "value": "10-1-201",
            "label": "201号"
          },
          {
            "value": "10-1-202",
            "label": "202号"
          },
          {
            "value": "10-1-301",
            "label": "301号"
          },
          {
            "value": "10-1-302",
            "label": "302号"
          },
          {
            "value": "10-1-401",
            "label": "401号"
          },
          {
            "value": "10-1-402",
            "label": "402号"
          },
          {
            "value": "10-1-501",
            "label": "501号"
          },
          {
            "value": "10-1-502",
            "label": "502号"
          },
          {
            "value": "10-1-601",
            "label": "601号"
          },
          {
            "value": "10-1-602",
            "label": "602号"
          },
          {
            "value": "10-1-701",
            "label": "701号"
          },
          {
            "value": "10-1-702",
            "label": "702号"
          },
          {
            "value": "10-1-801",
            "label": "801号"
          },
          {
            "value": "10-1-802",
            "label": "802号"
          },
          {
            "value": "10-1-901",
            "label": "901号"
          },
          {
            "value": "10-1-902",
            "label": "902号"
          },
          {
            "value": "10-1-1001",
            "label": "1001号"
          },
          {
            "value": "10-1-1002",
            "label": "1002号"
          },
          {
            "value": "10-1-1101",
            "label": "1101号"
          },
          {
            "value": "10-1-1102",
            "label": "1102号"
          },
          {
            "value": "10-1-1201",
            "label": "1201号"
          },
          {
            "value": "10-1-1202",
            "label": "1202号"
          },
          {
            "value": "10-1-1301",
            "label": "1301号"
          },
          {
            "value": "10-1-1302",
            "label": "1302号"
          },
          {
            "value": "10-1-1401",
            "label": "1401号"
          },
          {
            "value": "10-1-1402",
            "label": "1402号"
          },
          {
            "value": "10-1-1501",
            "label": "1501号"
          },
          {
            "value": "10-1-1502",
            "label": "1502号"
          },
          {
            "value": "10-1-1601",
            "label": "1601号"
          },
          {
            "value": "10-1-1602",
            "label": "1602号"
          }
        ]
      }
    ]
  }
];

export default buildingData;